cases/uniformBreakup/constant/turbulenceProperties.bubbles
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.bubbles;
}

simulationType  laminar;
