cases/uniformBreakup/constant/turbulenceProperties.water
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties.water;
}

simulationType  laminar;
