cases/uniformBreakup/0.orig/lambda.bubbles
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      lambda.bubbles;
}

dimensions      [0 -3 0 0 0 0 0];

internalField   uniform 0.0;

boundaryField
{
    empties
    {
        type            empty;
    }
}
