cases/uniformBreakup/system/probes
probes
{
    type                probes;
    functionObjectLibs  ("libsampling.so");

    writeControl        timeStep;
    writeInterval       1;

    probeLocations
    (
        (0.5 0.5 0.5)
    );

    fields
    (
        lambda.bubbles
        kappa.bubbles
        alpha.bubbles
        beta.bubbles
    );
}
